Repository: flyeblue/opencv401
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh

source: "black box" representation of the file storage associated with a file on disk
zh: "黑盒"表示存储在磁盘上的文件

source: "black box" representation of the file storage associated with a file on disk.
zh: "黑盒" 表示与存储在磁盘上的文件.

source: # Add one to all labels so that sure background is not 0, but 1
zh: # 添加一个到所有标签，以确保背景不是0，而是1

source: # Apply KMeans
zh: # 应用 KMeans

source: # Convert datatype to 8-bit and save
zh: # 转换数据类型为8-bit 并保存

source: # Define criteria = ( type, max_iter = 10 , epsilon = 1.0 )
zh: # 定义条件 = ( type, max_iter = 10 , epsilon = 1.0 )

source: # Exposure fusion using Mertens
zh: # 使用Mertens进行曝光融合

source: # Finding sure foreground area
zh: # 找到前景区域

source: # Finding unknown region
zh: # 寻找未知区域

source: # I want to put logo on top-left corner, So I create a ROI
zh: # 我想把标志放在左上角，所以我创造了一个ROI

source: # Initiate SIFT detector
zh: # 初始化 SIFT 检测器

source: # Load two images
zh: # 读取两个图片

source: # Loading exposure images into a list
zh: # 将曝光图像加载到列表中

source: # Marker labelling
zh: # 作标记

source: # Merge exposures to HDR image
zh: # 合并曝光到HDR图像

source: # Now black-out the area of logo in ROI
zh: # 现在，ROI中的徽标区域变黑

source: # Now create a mask of logo and create its inverse mask also
zh: # 现在创建一个徽标掩码并创建其反转掩码

source: # Now plot 'A' in red, 'B' in blue, 'centers' in yellow
zh: # 现在我们用红色绘制A，用蓝色绘制B，用黄色绘制质心。

source: # Now, mark the region of unknown with zero
zh: # 现在，用零标记未知区域

source: # Put logo in ROI and modify the main image
zh: # 在ROI中放置徽标并修改主图像

source: # Set flags (Just to avoid line break in the code)
zh: # 设置 flags (Just to avoid line break in the code)

source: # Take only region of logo from logo image.
zh: # 仅从徽标图像中获取徽标区域。

source: # accessing RED value
zh: # 访问RED值

source: # accessing only blue pixel
zh: # 只访问蓝色像素

source: # create a mask
zh: # 创建掩码 mask

source: # modifying RED value
zh: # 修改 RED 值

source: # noise removal
zh: # 移除噪音

source: # sure background area
zh: # 确定背景区域

source: (I will show an example later.)
zh: (我稍后会举一个例子。)

source: (Image is displayed with matplotlib.
zh: (使用matplotlib显示图像.

source: (In some cases, you may be interested in only foreground segmentation, not in separating the mutually touching objects.
zh: （在某些情况下，您可能只对前景分割感兴趣，而不是分离相互接触的对象。

source: (Remember, this histogram is drawn for grayscale image, not color image).
zh: （请记住，此直方图是为灰度图像绘制的，而不是彩色图像）。

source: (Well, there are blurring techniques which doesn't blur the edges too).
zh: (嗯，有模糊的技术也不会模糊边缘).

source: (You can download the images from Wikipedia)
zh: (你可以下载图片，从 Wikipedia)

source: *( Examples will be shown in Python terminal since most of them are just single line codes )*
zh: *（示例将在Python终端中显示，因为它们中的大多数只是单行代码）*

source: *(NB : Centroid, Area, Perimeter etc also belong to this category, but we have seen it in last chapter)*
zh: *(NB：Centroid，Area，Perimeter等也属于这个类别，但我们在上一章已经看过了)*

source: ../../search/search.css
zh: ../../搜索/search.css

source: 2D Convolution ( Image Filtering )
zh: 2D 卷积 ( 图像过滤 )

source: Board of markers
zh: 板块 标签

source: Classes | Enumerations | Functions
zh: 类 | 枚举 | 函数

source: CommandLineParser (const CommandLineParser &parser)
zh: 命令行解析 (const CommandLineParser &parser)

source: More...
zh: 更多...

source: Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
zh: 公共成员函数 | 受保护的成员函数 | 受保护的属性 | 成员列表

source: cv.split() is a costly operation (in terms of time).
zh: cv.split()是一项昂贵的操作（就时间而言）。

source: ~Tracker () CV_OVERRIDE
zh: ~跟踪器 () CV_OVERRIDE

source: cv.BORDER_CONSTANT - Adds a constant colored border.
zh: cv.BORDER_CONSTANT - 添加恒定的彩色边框.

source: cv.BORDER_REPLICATE - Last element is replicated throughout, like this: aaaaaa|abcdefgh|hhhhhhh
zh: cv.BORDER_REPLICATE - 最后一个元素被复制, 像这样: aaaaaa|abcdefgh|hhhhhhh

source: cv.BORDER_WRAP - Can't explain, it will look like this : cdefgh|abcdefgh|abcdefg
zh: cv.BORDER_WRAP - 不扩展, 类似这样 : cdefgh|abcdefgh|abcdefg

source: cv.findHomography() returns a mask which specifies the inlier and outlier points.
zh: cv.findHomography() 返回一个指定内部和异常点的掩码。

source: BINS :The above histogram shows the number of pixels for every pixel value, ie from 0 to 255.
zh: BINS :上面的直方图显示了每个像素值的像素数，从0 到 255.

source: DIMS : It is the number of parameters for which we collect the data.
zh: DIMS : 它是我们收集数据的参数数量.

source: Proficiency with Numpy is a must in order to write optimized code using OpenCV-Python.
zh: 为了使用OpenCV-Python编写优化代码，必须熟练使用Numpy。

source: RANGE : It is the range of intensity values you want to measure.
zh: RANGE : 它是您要测量的强度值范围。

source: This guide is mainly focused on OpenCV 3.x version (although most of the tutorials will also work with OpenCV 2.x).
zh: 本向导主要基于OpenCV 3.x 版本 (绝大部分也适用于 OpenCV 2.x).

source: attempts : Flag to specify the number of times the algorithm is executed using different initial labellings.
zh: attempts：用于指定使用不同初始标记执行算法的次数的标志。

source: borderType - Flag defining what kind of border to be added.
zh: borderType - 标志定义要添加的边框类型.

source: centers : This is array of centers of clusters.
zh: centers ：这是一组聚类中心。

source: compactness : It is the sum of squared distance from each point to their corresponding centers.
zh: compactness : 它是从每个点到其相应中心的平方距离之和。

source: criteria : It is the iteration termination criteria.
zh: criteria ： 它是迭代终止标准。

source: cv.TERM_CRITERIA_EPS + cv.TERM_CRITERIA_MAX_ITER - stop the iteration when any of the above condition is met.
zh: cv.TERM_CRITERIA_EPS + cv.TERM_CRITERIA_MAX_ITER - 停止，达到以上任意一个条件

source: cv.TERM_CRITERIA_EPS - stop the algorithm iteration if specified accuracy, epsilon, is reached.
zh: cv.TERM_CRITERIA_EPS - 停止，如果达到指定精度, epsilon， 达到。

source: cv.TERM_CRITERIA_MAX_ITER - stop the algorithm after the specified number of iterations, max_iter.
zh: cv.TERM_CRITERIA_MAX_ITER - 停止，达到最大次数 max_iter

source: flags : This flag is used to specify how initial centers are taken.
zh: flags ：该标志用于指定初始中心的采用方式。

source: labels : This is the label array (same as 'code' in previous article) where each element marked '0', '1'.....
zh: labels ：这是标签数组（与前一篇文章中的“代码”相同）where each element marked '0', '1'.....

source: nclusters(K) : Number of clusters required at end
zh: nclusters(K) ：结束时所需的集群数量

source: samples : It should be of np.float32 data type, and each feature should be put in a single column.
zh: 样本 ：数据类型 np.float32 , 每个功能都应该放在一个列中

source: src - input image
zh: src - 输入图片

source: top, bottom, left, right - border width in number of pixels in corresponding directions
zh: top, bottom, left, right - 相应方向上的像素数的边界宽度

source: value - Color of border if border type is cv.BORDER_CONSTANT
zh: value - 彩色边框如果类型为cv.BORDER_CONSTANT

source: boundingBox
zh: 边界框

source: CBoard
zh: C板块

source: A 3x3 normalized box filter would look like below:
zh: 3x3标准化的盒式过滤器如下所示:

source: A 5x5 averaging filter kernel will look like below:
zh: 5x5平均滤波器内核如下所示:

source: A Quick guide to Python - A Byte of Python
zh: Python快速向导 - A Byte of Python

source: A good knowledge of Numpy is required to write better optimized code with OpenCV.
zh: 使用OpenCV编写更好的优化代码需要熟悉Numpy.

source: A line can be represented as \(y = mx+c\) or in a parametric form, as \(\rho = x \cos \theta + y \sin \theta\) where \(\rho\) is the perpendicular distance from the origin to the line, and \(\theta\) is the angle formed by this perpendicular line and the horizontal axis measured in counter-clockwise (That direction varies on how you represent the coordinate system.
zh: 一条线在x坐标系里表示为 \(y = mx+c\) 或者 在极坐标里表示为A line can be represented as \(y = mx+c\) or in a parametric form, as \(\rho = x \cos \theta + y \sin \theta\) where \(\rho\) is the perpendicular distance from the origin to the line, and \(\theta\) is the angle formed by this perpendicular line and the horizontal axis measured in counter-clockwise (That direction varies on how you represent the coordinate system.

source: Above, we told that contours are the boundaries of a shape with same intensity.
zh: 上面，我们告诉轮廓是具有相同强度的形状的边界.

source: Access image properties
zh: 访问图像属性

source: Access pixel values and modify them
zh: 访问像素值并修改它们

source: Accessing Image Properties
zh: 访问图像属性

source: Accessing and Modifying pixel values
zh: 访问和修改像素值

source: Actually, in some cases the values can be larger than 1 or lower the 0, so notice we will later have to clip the data in order to avoid overflow.
zh: 实际上，在某些情况下，值可能大于1或小于0，因此请注意我们稍后将不得不剪切数据以避免溢出.

source: Actually, it should be a tuple of 3 parameters.
zh: 实际上，它应该是3个参数的元组。

source: Additional Resources
zh: 其他资源

source: Additional complexities arise when objects of the scene or camera move between shots, since images with different exposures should be registered and aligned.
zh: 当场景或相机的物体在镜头之间移动时会出现额外的复杂性，因为应该注册和对齐具有不同曝光的图像.

source: After the HDR image has been merged, it has to be converted back to 8-bit to view it on usual displays.
zh: 合并HDR图像后，必须将其转换回8位以在通常的显示器上查看。

source: All corners below quality level are rejected.
zh: 低于质量水平的所有角落都被拒绝.

source: All the OpenCV array structures are converted to and from Numpy arrays.
zh: 所有OpenCV数组结构都与Numpy数组进行转换。

source: Almost all image processing tools today, provides features on histogram.
zh: 今天几乎所有的图像处理工具都提供了直方图的功能。

source: Almost all the operations in this section is mainly related to Numpy rather than OpenCV.
zh: 本节中的几乎所有操作主要与Numpy而不是OpenCV有关.

source: And after the clustering, we apply centroid values (it is also R,G,B) to all pixels, such that resulting image will have specified number of colors.
zh: 在聚类之后，我们将质心值（它也是R，G，B）应用于所有像素，这样得到的图像将具有指定数量的颜色。

source: And again we need to reshape it back to the shape of original image.
zh: 我们需要再次将其重塑为原始图像的形状。

source: And it outputs the contours and hierarchy.
zh: 它输出轮廓和层次结构.

source: And that is what is shown in example given in OpenCV Tutorials on histograms.
zh: 这就是关于 直方图OpenCV 教程的示例。

source: Another desirable property is to have the tests uncorrelated, since then each test will contribute to the result.
zh: 另一个理想的特性是使测试不相关，因为每次测试都会对结果产生影响。

source: Another parameter, WTA_K decides number of points that produce each element of the oriented BRIEF descriptor.
zh: 另一个参数WTA_K决定了生成定向的BRIEF描述符的每个元素的点数。

source: Any grayscale image can be viewed as a topographic surface where high intensity denotes peaks and hills while low intensity denotes valleys.
zh: 任何灰度图像都可以看作是地形表面，其中高强度表示峰和丘陵，而低强度表示山谷.

source: Application of Mask
zh: 掩码的使用

source: Applies the bilateral filter to an image.
zh: 将双边滤镜应用于图像.

source: Apply custom-made filters to images (2D convolution)
zh: 将定制过滤器应用于图像（2D卷积）

source: Arithmetic Operations on Images
zh: 图片的算术运算

source: As an OpenCV enthusiast, the most important thing about the ORB is that it came from "OpenCV Labs".
zh: 作为OpenCV爱好者，关于ORB最重要的是它来自“OpenCV Labs”。

source: As an example, we will try an averaging filter on an image.
zh: 例如，我们将尝试对图像进行平均滤波.

source: As in one-dimensional signals, images also can be filtered with various low-pass filters(LPF), high-pass filters(HPF) etc.
zh: 与一维信号一样，图像也可以使用各种低通滤波器（LPF），高通滤波器（HPF）等进行滤波.

source: As new modules are added to OpenCV-Python, this tutorial will have to be expanded.
zh: 随着新模块添加到OpenCV-Python，本教程将进行扩展。

source: As the title says, it is a good alternative to SIFT and SURF in computation cost, matching performance and mainly the patents.
zh: 正如标题所说，它是计算成本，匹配性能和主要专利的SIFT和SURF的良好替代品。

source: As the water rises, depending on the peaks (gradients) nearby, water from different valleys, obviously with different colors will start to merge.
zh: 随着水位上升，取决于附近的峰值（梯度），来自不同山谷的水，明显具有不同的颜色将开始合并.

source: As usual, image should be a grayscale image.
zh: 像往常一样，图像应该是灰度图像.

source: As usual, we have to create an ORB object with the function, cv.ORB() or using feature2d common interface.
zh: 像往常一样，我们必须使用函数， cv.ORB() 或者使用feature2d公共接口创建一个ORB对象。

source: Aspect Ratio
zh: 纵横比

source: Authors came up with following modification.
zh: 作者提出了以下修改。

source: BINS is represented by the term histSize in OpenCV docs.
zh: BINS由OpenCV docs中的术语histSize表示。

source: BRIEF has an important property that each bit feature has a large variance and a mean near 0.5.
zh: BRIEF具有一个重要特性，即每个位特征具有较大的方差，平均值接近0.5。

source: Background Subtraction
zh: 背景减法

source: Background Subtraction is a well-known method in those cases.
zh: 在这些情况下，背景减法是众所周知的方法.

source: Base abstract class for the long-term tracker:
zh: long-term跟踪器基础抽象类:

source: Base abstract class for the long-term tracker: More...
zh: long-term跟踪器抽象基础类: More...

source: Basic Numpy Tutorials
zh: Numpy 基础教程

source: Basic Operations on Images
zh: 图像的基本操作

source: Basics
zh: 基本信息

source: Before that we need to specify the criteria.
zh: 在此之前，我们需要指定标准。

source: Before using those functions, we need to understand some terminologies related with histograms.
zh: 在使用这些功能之前，我们需要了解一些与直方图相关的术语。

source: Below image of a rectangle demonstrate this technique.
zh: 下面的矩形图像展示了这种技术.

source: Below is a sample code demonstrating all these border types for better understanding:
zh: 下面是一个示例代码，演示了所有这些边框类型，以便更好地理解:

source: Below is a simple code which shows the use of ORB.
zh: 下面是一个简单的代码，显示了ORB的用法。

source: Below is an image from Cambridge in Color website, and I recommend you to visit the site for more details.
zh: 以下是来自 Cambridge in Color website图片，，我建议您访问该网站了解更多详情。

source: Below is the code:
zh: 下面是代码：

source: Below is the list of contributors who submitted tutorials to OpenCV-Python.
zh: 以下是向OpenCV-Python提交教程的贡献者列表。

source: Below is the output we got:
zh: 以下是我们得到的输出：

source: Below samples shows use bilateral filter (For details on arguments, visit docs).
zh: 下面的示例显示使用双边过滤器（有关参数的详细信息，请访问docs）.

source: Below we will see an example on how to change a particular region of an image.
zh: 下面我们将看到一个如何更改图像特定区域的示例。

source: Below we will see an example on how to use the Distance Transform along with watershed to segment mutually touching objects.
zh: 下面我们将看到一个如何使用距离变换和分水岭来分割相互接触的物体的示例.

source: Best practice is to try the different methods and see which one performs best for your scene.
zh: 最佳做法是尝试不同的方法，看看哪种方法最适合您的场景.

source: Better pixel accessing and editing method :
zh: 更好的像素访问和编辑方法:

source: Bilateral Filtering
zh: 双边过滤

source: Bilateral filter also takes a gaussian filter in space, but one more gaussian filter which is a function of pixel difference.
zh: 双边滤波器在空间中也采用高斯滤波器，但还有一个高斯滤波器，它是像素差的函数.

source: Bitwise Operations
zh: 位运算

source: Blur the images with various low pass filters
zh: 使用各种低通滤波器模糊图像

source: Blurs an image using a Gaussian filter.
zh: 使用高斯滤波器模糊图像.

source: Blurs an image using the box filter.
zh: 使用盒式过滤器模糊图像.

source: Blurs an image using the median filter.
zh: 使用中值滤波器模糊图像.

source: Blurs an image using the normalized box filter.
zh: 使用标准化的盒式过滤器模糊图像.

source: Board of markers.
zh: 板块标签.

source: Both OpenCV and Numpy come with in-built function for this.
zh: OpenCV和Numpy都具有函数实现。

source: Both images should be of same depth and type, or second image can just be a scalar value.
zh: 两个图像应该具有相同的深度和类型，或者第二个图像可以是标量值。

source: But I want it to be opaque.
zh: 但是我期望它不透明

source: But ORB is not !!!
zh: 但是 ORB 不是！！！

source: But OpenCV logo is a not a rectangular shape.
zh: 但是 OpenCV logo 不是一个矩形

source: But a good image will have pixels from all regions of the image.
zh: 但是，良好的图像将包含所有取值范围内的值。

source: But actually do we need all the points?
zh: 但实际上我们需要所有的点?

source: But bins will have 257 elements, because Numpy calculates bins as 0-0.99, 1-1.99, 2-2.99 etc.
zh: 但是bins将有257个元素，因为Numpy计算bins为0-0.99,1-1.99,2-2.99等。

source: But consider, what if you need not find the number of pixels for all pixel values separately, but number of pixels in a interval of pixel values?
zh: 但是考虑一下，如果你不需要分别找到所有像素值的像素数，但像素值区间的像素数是多少？

source: But does it store all the coordinates ?
zh: 但它是否存储了所有坐标?

source: But if you want to find histogram of particular region of image, you have to create a mask image for that and give it as mask.
zh: 但是如果你想找到图像特定区域的直方图，你必须为它创建一个蒙版图像并将其作为蒙版mask。

source: But in median blurring, central element is always replaced by some pixel value in the image.
zh: 但在中值模糊中，中心元素总是被图像中的某个像素值所取代.

source: But it has more applications for convolution operation, zero padding etc.
zh: 但它有更多的应用卷积运算，零填充等。

source: But most of the time, below method will be useful:
zh: 但大多数时候，下面的方法会很有用:

source: But once it is oriented along keypoint direction, it loses this property and become more distributed.
zh: 但是一旦它沿着关键点方向定向，它就会失去这个属性并变得更加分散。

source: But one problem is that, FAST doesn't compute the orientation.
zh: 但有一个问题是，FAST不计算方向。

source: But since they are touching each other, another good option would be to find the distance transform and apply a proper threshold.
zh: 但由于它们相互接触，另一个好的选择是找到距离变换并应用适当的阈值.

source: But the operation is slower compared to other filters.
zh: 但与其他过滤器相比，操作速度较慢.

source: But this approach gives you oversegmented result due to noise or any other irregularities in the image.
zh: 但是这种方法会因图像中的噪声或任何其他不规则性而给出过度调整结果.

source: But we don't need that 256.
zh: 但是我们不需要256。

source: But we have already seen that BRIEF performs poorly with rotation.
zh: 但我们已经看到，Brief在轮换方面表现不佳。

source: But we know that if background is marked with 0, watershed will consider it as unknown area.
zh: 但我们知道，如果背景标记为0，分水岭会将其视为未知区域.

source: By default it is two, ie selects two points at a time.
zh: 默认情况下它是2，即一次选择两个点。

source: By looking at the histogram of an image, you get intuition about contrast, brightness, intensity distribution etc of that image.
zh: 通过查看图像的直方图，您可以直观了解该图像的对比度，亮度，强度分布等。

source: By varying \(\alpha\) from \(0 \rightarrow 1\), you can perform a cool transition between one image to another.
zh: 通过增减 \(\alpha\) from \(0 \rightarrow 1\), 您可以在一个图像与另一个图像之间执行很酷的过渡。

source: Calculates a histogram of a set of arrays.
zh: 计算一组数组的直方图。

source: Calculates the per-element sum of two arrays or an array and a scalar.
zh: 计算两个数组或数组和标量的每元素总和。

source: Calculates the weighted sum of two arrays.
zh: 计算两个数组的加权和

source: Camera Calibration and 3D Reconstruction
zh: 相机校准和3D重建

source: ChArUco board Specific class for ChArUco boards.
zh: ChArUco 板块类规范

source: Check a sample demo below with a kernel of 5x5 size:
zh: 使用5x5大小的内核检查下面的示例演示:

source: Check image below:
zh: 检测下面的图片

source: Check the code at samples/python/hist.py.
zh: 查看代码 samples/python/hist.py.

source: Check the docs for more details about the kernel.
zh: 查看文档以获取有关内核的更多详细信息.

source: Check the image below:
zh: 检测下面的图片

source: Check the result below:
zh: 查看下面的结果：

source: Check the result:
zh: 查看结果:

source: Check the results below:
zh: 查看下面的结果：

source: Class List
zh: 类列表

source: Class implementing the ORB (oriented BRIEF) keypoint detector and descriptor extractor.
zh: 实现ORB（面向简要）关键点检测器和描述符提取器的类。

source: Code
zh: 代码

source: Color Quantization
zh: 彩色量化

source: Color Quantization is the process of reducing number of colors in an image.
zh: 颜色量化是减少图像中颜色数量的过程。

source: CommandLineParser
zh: 命令行参数解析

source: Compared to languages like C/C++, Python is slower.
zh: 相比 C/C++，Python比较慢.

source: Computational Photography
zh: 计算机摄影

source: Consider an image whose pixel values are confined to some specific range of values only.
zh: 考虑一个像素值仅限于某些特定值范围的图像。

source: Consider the coins image below, the coins are touching each other.
zh: 考虑下面的硬币图像，硬币互相接触。

source: Consider, you have a set of data with only one feature, ie one-dimensional.
zh: 考虑一下，你有一组只有一个特征的数据，即一维。

source: Constructor.
zh: 构造函数.

source: Contour Approximation Method
zh: 轮廓逼近法

source: Contour Features
zh: 轮廓特征

source: Contour Properties
zh: 轮廓属性

source: Contours : Getting Started
zh: 轮廓：入门

source: Contours : More Functions
zh: 轮廓 : 更多函数

source: Contours Hierarchy
zh: 轮廓层次结构

source: Contours can be explained simply as a curve joining all the continuous points (along the boundary), having same color or intensity.
zh: 轮廓可以简单地解释为连接所有连续点（沿着边界）的曲线，具有相同的颜色或强度.

source: Contours in OpenCV
zh: OpenCV中的轮廓

source: Contours is a Python list of all the contours in the image.
zh: Contours是图像中所有轮廓的Python列表.

source: Contributors
zh: 参与者

source: Convert to 8-bit and save
zh: 转化为 8-bit 并保存

source: Convolves an image with the kernel.
zh: 用内核卷积图像.

source: Core Operations
zh: 核心基础操作

source: Create a kernel package object containing kernels specified in variadic template argument.
zh: 创建一个带变量的核.

source: Create a slide show of images in a folder with smooth transition between images using cv.addWeighted function
zh: 创建并显示图片平滑过渡，用cv.addWeighted函数

source: Data with Only One Feature
zh: 只有一个功能的数据

source: Destructor.
zh: 析构函数.

source: Detailed Description
zh: 细节描述

source: Determines strong corners on an image.
zh: 确定图像上的强角.

source: Dilation increases object boundary to background.
zh: 膨胀将物体边界增加到背景.

source: Divides a multi-channel array into several single-channel arrays.
zh: 将多通道阵列分成几个单通道阵列.

source: Do you have a old degraded photo with many black spots and strokes on it?
zh: 你有一张有很多黑点和划痕的旧照片?

source: Do you need all the points on the line to represent that line?
zh: 您是否需要线上的所有点来表示该线?

source: Don't forget to set minlength = 256 in np.bincount.
zh: 在np.bincoun中，不要忘记设置 minlength = 256。

source: Draws a line segment connecting two points.
zh: 绘制连接两个点的线段。

source: Draws contours outlines or filled contours.
zh: 绘制轮廓轮廓或填充轮廓.

source: Dynamic range improvement through multiple exposures.
zh: 通过多次曝光改善动态范围.

source: Each feature is arranged in a column, while each row corresponds to an input test sample.
zh: 每个特征排列在一列中，而每行对应一个输入测试样本。

source: Each individual contour is a Numpy array of (x,y) coordinates of boundary points of the object.
zh: 每个单独的轮廓是对象的边界点的（x，y）坐标的Numpy阵列.

source: Each step of HDR pipeline can be implemented using different algorithms and parameters, so take a look at the reference manual to see them all.
zh: HDR流水线的每个步骤都可以使用不同的算法和参数来实现，因此请查看参考手册以查看所有步骤。

source: Equalizes the histogram of a grayscale image.
zh: 灰度图直方图均衡化

source: Equivalent Diameter
zh: 等效直径

source: Equivalent Diameter is the diameter of the circle whose area is same as the contour area.
zh: 等效直径是圆的直径，其面积与轮廓面积相同.

source: Erosion is just another method to extract sure foreground area, that's all.)
zh: 侵蚀只是提取确定前景区域的另一种方法，就是这样。）

source: Erosion removes the boundary pixels.
zh: 侵蚀消除了边界像素.

source: Estimating Camera Response Function
zh: 估计相机响应功能

source: Even if you threshold it, it will be touching each other.
zh: 即使你达到阈值，它也会相互接触.

source: Exercises
zh: 演示

source: Exposure fusion.
zh: 曝光融合.

source: Extent
zh: 范围

source: Extent is the ratio of contour area to bounding rectangle area.
zh: 范围是轮廓区域与边界矩形区域的比率.

source: Extreme Points
zh: 极值点

source: Extreme Points means topmost, bottommost, rightmost and leftmost points of the object.
zh: 极值点表示对象的最顶部，最底部，最右侧和最左侧的点.

source: Feature Detection and Description
zh: 特征检测和描述

source: Find Histogram
zh: 查找直方图

source: Find histograms, using both OpenCV and Numpy functions
zh: 使用OpenCV和Numpy函数查找直方图

source: Finds a perspective transformation between two planes.
zh: 找到两个平面之间的透视变换。

source: Finds centers of clusters and groups input samples around the clusters.
zh: 查找群集的中心并在群集周围分组输入样本。

source: Finds contours in a binary image.
zh: 在二进制图像中查找轮廓.

source: Finds line segments in a binary image using the probabilistic Hough transform.
zh: 使用概率Hough变换在二进制图像中查找线段。

source: Finds lines in a binary image using the standard Hough transform.
zh: 使用标准Hough变换在二进制图像中查找线条。

source: First column corresponds to height of all the 50 people and second column corresponds to their weights.
zh: 第一列对应于所有50个人的高度，第二列对应于它们的权重。

source: First image is given a weight of 0.7 and second image is given 0.3.
zh: 第一张图片权重 0.7第二张图片权重0.3。

source: First image shows points I got with cv.CHAIN_APPROX_NONE (734 points) and second image shows the one with cv.CHAIN_APPROX_SIMPLE (only 4 points).
zh: 第一张图使用参数 cv.CHAIN_APPROX_NONE (734 个点) ，第二张图使用参数 cv.CHAIN_APPROX_SIMPLE (只有 4 个点).

source: First it use FAST to find keypoints, then apply Harris corner measure to find top N points among them.
zh: 首先，它使用FAST查找关键点，然后应用Harris角点测量来查找其中的前N个点。
